Ran Plan for 2 projects:

1. project: `vpc/tmcd_apnortheast2` dir: `terraform/vpc/tmcd_apnortheast2` workspace: `default`
1. project: `vpc/testd_apnortheast2` dir: `terraform/vpc/testd_apnortheast2` workspace: `default`

### 1. project: `vpc/tmcd_apnortheast2` dir: `terraform/vpc/tmcd_apnortheast2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_route.private_peering["testd_apnortheast2_rtb-0631a8f428a1c8523"] will be created
+ resource "aws_route" "private_peering" {
      + destination_cidr_block    = "10.20.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0631a8f428a1c8523"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "vpc-065779b9f959ff450"
    }

  # aws_route.private_peering["testd_apnortheast2_rtb-097f508069fecd8ef"] will be created
+ resource "aws_route" "private_peering" {
      + destination_cidr_block    = "10.20.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-097f508069fecd8ef"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "vpc-065779b9f959ff450"
    }

  # aws_vpc_peering_connection_accepter.peering_accepter["vpc-065779b9f959ff450"] will be created
+ resource "aws_vpc_peering_connection_accepter" "peering_accepter" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + tags                      = {
          + "Name" = "vpc-peering-tmcdapne2-with-testd_apnortheast2"
        }
      + tags_all                  = {
          + "Name" = "vpc-peering-tmcdapne2-with-testd_apnortheast2"
        }
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = "vpc-065779b9f959ff450"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc/tmcd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fvpc%252Ftmcd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc/tmcd_apnortheast2`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
### 2. project: `vpc/testd_apnortheast2` dir: `terraform/vpc/testd_apnortheast2` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_route.private_peering["tmcd_apnortheast2_rtb-0456ec5ec52e8cacf"] will be created
+ resource "aws_route" "private_peering" {
      + destination_cidr_block    = "10.10.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-0456ec5ec52e8cacf"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-025125d9f044c1d1e"
    }

  # aws_route.private_peering["tmcd_apnortheast2_rtb-08eb718ec2c0aa4a6"] will be created
+ resource "aws_route" "private_peering" {
      + destination_cidr_block    = "10.10.0.0/16"
      + id                        = (known after apply)
      + instance_id               = (known after apply)
      + instance_owner_id         = (known after apply)
      + network_interface_id      = (known after apply)
      + origin                    = (known after apply)
      + route_table_id            = "rtb-08eb718ec2c0aa4a6"
      + state                     = (known after apply)
      + vpc_peering_connection_id = "pcx-025125d9f044c1d1e"
    }

  # aws_vpc_peering_connection_accepter.peering_accepter["pcx-025125d9f044c1d1e"] will be created
+ resource "aws_vpc_peering_connection_accepter" "peering_accepter" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + tags                      = {
          + "Name" = "vpc-peering-testdapne2-with-tmcd_apnortheast2"
        }
      + tags_all                  = {
          + "Name" = "vpc-peering-testdapne2-with-tmcd_apnortheast2"
        }
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = "pcx-025125d9f044c1d1e"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p vpc/testd_apnortheast2`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fvpc%252Ftestd_apnortheast2%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p vpc/testd_apnortheast2`
</details>
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
